## Data Merging

In [1]:
#import Libraries
import pandas as pd
import numpy as np

In [3]:
# Example datasets for datamerging
data1 ={
    'Id' : [1,2,3],
    'Name' : ['Ali', 'Ayesha', 'Fatima'],
    'Age' : [23, 20, 24]
}
df1 = pd.DataFrame(data1)
df1.head()

   Id    Name  Age
0   1     Ali   23
1   2  Ayesha   20
2   3  Fatima   24

In [5]:
data2 ={
    'Id' : [1,2,3],
    'Occupation' : ['Teacher', 'Doctor', 'Engineer'],
    'City' : ['Lahore', 'Islamabad', 'Karachi']
}
df2 = pd.DataFrame(data2)
df2.head()

   Id Occupation       City
0   1    Teacher     Lahore
1   2     Doctor  Islamabad
2   3   Engineer    Karachi

In [9]:
#merging Dataframe on id
merged_df = pd.merge(df1, df2, on='Id', how='outer')
merged_df.head()

   Id    Name  Age Occupation       City
0   1     Ali   23    Teacher     Lahore
1   2  Ayesha   20     Doctor  Islamabad
2   3  Fatima   24   Engineer    Karachi

## Concatination

In [13]:
# Example datasets for Pakistani context
# Dataset 1 - Pakistani Names and Ages
data1 = {'Name': ['Ahmed', 'Fatima', 'Ali'], 'Age': [28, 32, 24]}

# Dataset 2 - More Pakistani Names and Ages
data2 = {'Name': ['Sara', 'Usman', 'Ayesha'], 'Age': [29, 35, 27]}

# Dataset 3 - Cities and Provinces in Pakistan
data3 = {'City': ['Karachi', 'Lahore', 'Islamabad'], 'Province': ['Sindh', 'Punjab', 'KPK']}

df1 = pd.DataFrame(data1)
print(df1.head())
df2 = pd.DataFrame(data2)

df3 = pd.DataFrame(data3)

     Name  Age
0   Ahmed   28
1  Fatima   32
2     Ali   24

In [14]:
#  Concatenating Rows
concatenated_rows = pd.concat([df1, df2])

In [15]:
# Concatenating Columns
# Note: For a meaningful column-wise concatenation, dataframes should have the same number of rows.
concatenated_columns = pd.concat([df1, df3], axis=1)
print(concatenated_rows)
print(";;;;;;;;;;;;;;;;;;;;;;;;;;;;;;")
concatenated_columns

     Name  Age
0   Ahmed   28
1  Fatima   32
2     Ali   24
0    Sara   29
1   Usman   35
2  Ayesha   27
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

     Name  Age       City Province
0   Ahmed   28    Karachi    Sindh
1  Fatima   32     Lahore   Punjab
2     Ali   24  Islamabad      KPK